[
  {
    "title": "Hardware",
    "plot": "A nomad scavenger treks through an irradiated wasteland and discovers a buried robot. He collects the pieces and takes them to junk dealer Alvy, who is talking with 'Hard Mo' Baxter, a former soldier, and Mo's friend Shades. When Alvy steps away, Mo buys the robot parts from the nomad and sells all but the head to Alvy. Intrigued by the technology, Alvy begins to research its background. Mo and Shades visit Jill, Mo's reclusive girlfriend, and, after an initially distant welcome where Jill…",
    "genre": "horror",
    "year": 1990,
    "poster": "https://via.placeholder.com/300x450?text=Hardware"
  },
  {
    "title": "The Mambo Kings",
    "plot": "In the early 1950s, Cuban brothers and musicians Cesar (Armand Assante) and Nestor Castillo (Antonio Banderas) flee from Havana, Cuba after getting into a violent dispute with the mobster owners of a club where they performed. Eventually ending up in New York City, the brothers work at menial jobs while attempting to revive their musical careers. At a nightclub where Cesar briefly crashes the act of mambo star Tito Puente, they make new friends and connections, as well as meeting cigarette girl…",
    "genre": "drama",
    "year": 1992,
    "poster": "https://via.placeholder.com/300x450?text=The%20Mambo%20Kings"
  },
  {
    "title": "Angels in the Outfield",
    "plot": "Young foster child Roger (Joseph Gordon-Levitt) and his friend J.P. (Milton Davis, Jr.) love to sneak into baseball games of the hopelessly dreadful California Angels. Still in limited contact with his widower father, Roger asks when they will be a family again. His father replies sarcastically, \"I'd say when the Angels win the pennant.\" Taking his father's words literally, Roger prays for God to help the Angels win. After he prays, a star, unseen by Roger, twinkles in the sky. Then, in a game…",
    "genre": "comedy, sports",
    "year": 1994,
    "poster": "https://via.placeholder.com/300x450?text=Angels%20in%20the%20Outfield"
  },
  {
    "title": "China Moon",
    "plot": "The story opens with detectives Kyle Bodine and Lamar Dickey investigating a murder scene. Bodine tutors Dickey in the ways of homicide investigations, stressing that all murderers make stupid mistakes, which is how they get caught. At a local bar, Bodine hits on Rachel Munro, who blows him off. Rachel is married to wealthy banker Rupert Munro. Back at home, she gets drunk as she looks at a private investigator's photos of Rupert making love to one of his employees, Adele. Rupert is…",
    "genre": "crime drama",
    "year": 1994,
    "poster": "https://via.placeholder.com/300x450?text=China%20Moon"
  },
  {
    "title": "Cool and the Crazy",
    "plot": "High School sweethearts Michael and Rosy happily marry during the 1950s, both 18. Things go along smoothly until Roslyn gets pregnant, at age 19. The bills pile up and the two grow apart from each other. Roslyn spends most of the time taking care of their child and hanging out with her best friend, Joannie, who's married to a guy named Bobby. Joannie's been cheating on her husband with a man named Frankie. Roslyn is introduced to Frankie's friend, Joey, a bad boy who's also married.…",
    "genre": "drama",
    "year": 1994,
    "poster": "https://via.placeholder.com/300x450?text=Cool%20and%20the%20Crazy"
  },
  {
    "title": "My Father the Hero",
    "plot": "André Arnel (Gérard Depardieu), a Frenchman divorced from his wife, takes his teenage daughter, Nicole (Katherine Heigl), on vacation with him to The Bahamas. She is desperate to appear as a woman and not a girl, so in order to impress a local boy Ben (Dalton James), she makes up more and more ridiculous stories, starting with André being her lover and leading to some bizarre assumptions by the rest of the community. André is desperate to make Nicole happy (especially as she is increasingly…",
    "genre": "comedy",
    "year": 1994,
    "poster": "https://via.placeholder.com/300x450?text=My%20Father%20the%20Hero"
  },
  {
    "title": "Mortal Kombat: The Journey Begins",
    "plot": "Mortal Kombat is a fighting tournament between the representatives of the realms of Earth and Outworld conceived by the Elder Gods amid looming invasion of the Earth by Outworld. If the realm of Outworld wins Mortal Kombat ten consecutive times, its Emperor Shao Kahn will be able to invade and conquer the Earthrealm. Shaolin monk Liu Kang and his comrades, movie star Johnny Cage and military officer Sonya Blade were handpicked by Raiden, the god of thunder and defender of the Earth realm, to…",
    "genre": "animated",
    "year": 1995,
    "poster": "https://via.placeholder.com/300x450?text=Mortal%20Kombat%3A%20The%20Journey%20Begins"
  },
  {
    "title": "National Lampoon's Senior Trip",
    "plot": "At Fairmount High School, Ohio, a group of teenage students begin their school with an assembly featuring a band called \"High on Life\", though they are selfish at teachers and the principal. As the band continues to play onstage, Mark \"Dags\" D'Agastino and Reggie Barry decide to sabotage the assembly by having a track played and exposing the band lip syncing their music as it ends drastically but upbeat. After a typing class, the seniors cut school and throw a party for Principal Moss. Moss…",
    "genre": "comedy",
    "year": 1995,
    "poster": "https://via.placeholder.com/300x450?text=National%20Lampoon%27s%20Senior%20Trip"
  },
  {
    "title": "The Bridges of Madison County",
    "plot": "In the present, adult siblings Michael and Carolyn arrive at the Iowa farmhouse of Francesca Johnson, their recently deceased, elderly mother, to see about the settlement of their mother's estate. As they go through the contents of her safe deposit box and the will, they are baffled to discover that their mother left very specific instructions that her body be cremated and her ashes thrown off the nearby Roseman Covered Bridge, which is not in accordance with the burial arrangements their…",
    "genre": "drama",
    "year": 1995,
    "poster": "https://via.placeholder.com/300x450?text=The%20Bridges%20of%20Madison%20County"
  },
  {
    "title": "Carried Away",
    "plot": "Joseph Svenden is a middle-aged schoolteacher who lives on a farm with his dying mother. In his simple life there is no excitement, even in his long-time relationship with a widow. However, when a 17-year-old beauty enrolls in his class, life takes an unexpected turn. She boards her horse in his barn and she then seduces him. They carry on a furtive relationship which leaves him torn between the passion, and knowing that he is doing something wrong. When her indescretion starts the inevitable…",
    "genre": "drama",
    "year": 1996,
    "poster": "https://via.placeholder.com/300x450?text=Carried%20Away"
  },
  {
    "title": "Fear",
    "plot": "16-year-old Nicole Walker (Reese Witherspoon) lives in the suburbs of Seattle with her overbearing father Steven (William Petersen), his new wife Laura (Amy Brenneman), and Toby (Christopher Gray), Laura's son from her first marriage. At a bar with her best friend Margo (Alyssa Milano), Nicole meets David McCall (Mark Wahlberg), and is instantly swept off her feet by his good looks and sweet, charming nature. The two begin a relationship. When Steven meets David, he mistrusts him immediately.…",
    "genre": "thriller",
    "year": 1996,
    "poster": "https://via.placeholder.com/300x450?text=Fear"
  },
  {
    "title": "Space Truckers",
    "plot": "At a corporation's base on the Neptunian moon Triton, mercenaries are setting up a defense perimeter to try to hold off an unstoppable cyborg warrior. The commander Saggs and scientist Nabel, seal themselves inside the control room. The cyborg destroys the soldiers' tank and then attacks a helicopter—which crashes into the control room. The soldiers are killed one by one, until Nabel finally deactivates the cyborg with a remote control. The remaining corporate employees discover that the cyborg…",
    "genre": "science fiction comedy",
    "year": 1996,
    "poster": "https://via.placeholder.com/300x450?text=Space%20Truckers"
  },
  {
    "title": "The Phantom",
    "plot": "In the early 16th century, a young boy helplessly witnesses his father's death at the hands of Kabai Sengh, the ruthless leader of the Sengh brotherhood who attacked their ship. The boy jumps overboard and is washed ashore on an island called Bengalla where he is found by tribesmen who take him to their village. There he is given the Skull Ring and swears to devote his life to the destruction of piracy, greed, cruelty and injustice. In adulthood, he adopts the identity of \"The Phantom\", a…",
    "genre": "action",
    "year": 1996,
    "poster": "https://via.placeholder.com/300x450?text=The%20Phantom"
  },
  {
    "title": "Unlikely Angel",
    "plot": "Parton stars as a somewhat-selfish country singer, Ruby Diamond,[2] whose untimely death while driving at night results in her gaining an audience with Saint Peter (Roddy McDowall). He offers her a rather unusual arrangement: she will return to Earth on a mission to reunite the suburban Bartilson family (a family that's been torn apart ever since the mother died). If she succeeds by midnight on Christmas Eve, then she will be granted her wings as an angel. If not, she will receive a fate much…",
    "genre": "family",
    "year": 1996,
    "poster": "https://via.placeholder.com/300x450?text=Unlikely%20Angel"
  },
  {
    "title": "Dante's Peak",
    "plot": "In 1993, United States Geological Survey volcanologist Dr. Harry Dalton and his colleague and fiance, Marianne, attempt to escape an eruption in Colombia. A piece of hot volcanic debris pierces through the roof of Harry's truck, killing Marianne. Four years later, Harry is assigned by his superior, Dr. Paul Dreyfus, to investigate seismic activity near Dante's Peak, Washington, a town that borders a dormant stratovolcano. Harry arrives at the town and meets with the mayor, Rachel Wando, and her…",
    "genre": "disaster film",
    "year": 1997,
    "poster": "https://via.placeholder.com/300x450?text=Dante%27s%20Peak"
  },
  {
    "title": "The Curve",
    "plot": "After hearing of a school policy granting anyone whose roommate commits suicide an automatic 4.0 GPA (see: Pass by catastrophe), Harvard Med School aspirants Tim (Matthew Lillard) and Chris (Michael Vartan) plot to kill their roommate Rand and make it look like suicide. They're successful, but when the fallout breeds unforeseen consequences and two local detectives close in, guilt and mistrust fester, jeopardizing Chris's relationship with his girlfriend Emma (Keri Russell) and the roommates'…",
    "genre": "thriller",
    "year": 1998,
    "poster": "https://via.placeholder.com/300x450?text=The%20Curve"
  },
  {
    "title": "The Mighty Kong",
    "plot": "Ann Darrow, a down-on-her-luck actress looking for work, meets film director Carl Denham, who offers her a job in a new film. They board the Venture to leave for the film shoot. The monkey that lives on board causes trouble throughout the trip. They arrive on the island and the natives, who are friendly to the crew, ask that the crew leave Ann so they can sacrifice her. Ann is then sacrificed to the giant ape King Kong who makes off with her into the jungle. Together they fight a Tyrannosaurus,…",
    "genre": "animated",
    "year": 1998,
    "poster": "https://via.placeholder.com/300x450?text=The%20Mighty%20Kong"
  },
  {
    "title": "The Rugrats Movie",
    "plot": "Didi Pickles is pregnant with a second baby, which everyone believes will be a girl. Didi goes into labor during the baby shower and her friends rush her to the hospital. While this is happening, the kids crawl off and explore a nursery area before being found by the other parents. When the baby is finally born after a montage of past lives, it is actually a boy and they name him Dil. Dil quickly becomes a very spoiled baby, crying non-stop for attention, keeping all of the toys for himself,…",
    "genre": "animated",
    "year": 1998,
    "poster": "https://via.placeholder.com/300x450?text=The%20Rugrats%20Movie"
  }
]
